      * 
      * GFS AFMLIST sample
      * 
       01 EMP-RECORD.
         05 FILLER                      PIC X(1).
         05 VOLUME-ID                   PIC X(6).
         05 FILLER                      PIC X(2).
         05 DATASET-ID                  PIC X(44).
